УправлениеСдачейКвартир/src/InformationRegisters/ЦеныНаКвартиры/ЦеныНаКвартиры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныНаКвартиры</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Квартира</name>
    <type>
      <types>CatalogRef.Квартиры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УправлениеСдачейКвартир/src/CommonModules/ЦеныНаКвартирыПосуточноВызовСервера/Module.bsl
#Область СлужебныеПроцедурыИФункции

Функция ПолучитьЦенуНаКвартиру(Квартира) Экспорт
	
	Если Квартира = Неопределено Тогда
		Возврат 0;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЦеныНаКвартирыСрезПоследних.Цена КАК Цена
		|ИЗ
		|	РегистрСведений.ЦеныНаКвартиры.СрезПоследних КАК ЦеныНаКвартирыСрезПоследних
		|ГДЕ
		|	ЦеныНаКвартирыСрезПоследних.Квартира = &Квартира";
	
	Запрос.УстановитьПараметр("Квартира", Квартира);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Цена;
	Иначе
		Возврат 0;
	КонецЕсли
	
	
	
КонецФункции

#КонецОбласти
